docs/org-publish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2025-07-29 Tue 16:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Publicación de los ficheros org en GitHub pages</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Publicación de los ficheros org en GitHub pages</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8b77249">Fichero <code>makefile</code></a>
<ul>
<li><a href="#org17a608d">Aclaraciones</a></li>
</ul>
</li>
<li><a href="#org9b7967f">Fichero <code>build.yml</code></a>
<ul>
<li><a href="#org91cbecb">Aclaraciones</a>
<ul>
<li><a href="#orgdf187f0">Consulta a Copilot sobre la generación de figuras</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c1ff12">Script <code>publica.el</code> de elisp para publicar los <code>.org</code> es formato <code>pdf</code> y <code>html</code></a></li>
<li><a href="#orgb3f19a7">slides para GitHubpages</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8b77249" class="outline-2">
<h2 id="org8b77249">Fichero <code>makefile</code></h2>
<div class="outline-text-2" id="text-org8b77249">
<p>
Genera el directorio público <code>docs</code> con los ficheros para GitPages con subdirectorios para los <code>CuadernosElectronicos</code>, <code>pdfs</code>, <code>Transparencias</code> y los ficheros con las lecciones en <code>html</code>.
</p>
</div>
<div id="outline-container-org17a608d" class="outline-3">
<h3 id="org17a608d">Aclaraciones</h3>
<div class="outline-text-3" id="text-org17a608d">
<p>
El directorio <code>./lecciones</code> es temporal. En dicho directorio se ejecutan los notebooks. Los ficheros creados se copian en distintos subdirectorios del directorio de publicación <code>./docs/</code> (es el directorio de donde "cuelgan" las páginas web; dichas páginas se distribuyen desde la rama <code>gh-pages</code> del repositorio).
</p>
</div>
</div>
</div>
