org-publish.org
* Fichero =build.yml=

Contiene las instrucciones que ejecutará GitHub Actions en el repositorio.

Usa el contenido de la rama =main=. 
#+BEGIN_SRC yml :tangle .github/workflows/build.yml
name: Build and Deploy

on:
  push:
    branches:
      - main

jobs:
  build:
    runs-on: ubuntu-latest

    steps:
    - name: Checkout repository
      uses: actions/checkout@v3

    - name: Set up Python
      uses: actions/setup-python@v4
      with:
        python-version: '3.9'

    - name: Install dependencies
      run: |
        sudo apt-get update
        sudo apt-get install -y git emacs pandoc aspell aspell-en aspell-es zip gretl
        pip install jupyter nbconvert

    - name: Install Python modules
      run: |
        pip install sympy numpy pandas matplotlib dataframe-image statsmodels seaborn

    - name: Verify Jupyter Installation
      run: |
        jupyter kernelspec list

    - name: Install LaTeX
      run: |
        sudo apt-get install -y texlive  texlive-latex-recommended texlive-latex-extra  texlive-fonts-extra texlive-fonts-recommended texlive-xetex texlive-science python3-pygments texlive-lang-spanish texlive-bibtex-extra texlive-binaries texlive-extra-utils texlive-font-utils texlive-luatex texlive-xetex dvipng

    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true

    - name: Clone Scimax
      run: |
        git clone https://github.com/jkitchin/scimax.git ~/Software/scimax

    - name: Download ox-ipynb.el
      run: |
        wget https://raw.githubusercontent.com/jkitchin/ox-ipynb/master/ox-ipynb.el -O ~/Software/scimax/ox-ipynb.el

    - name: Install s.el and dash.el
      run: |
        emacs --batch --eval "(require 'package)" \
                      --eval "(add-to-list 'package-archives '(\"melpa\" . \"https://melpa.org/packages/\"))" \
                      --eval "(package-refresh-contents)" \
                      --eval "(package-install 's)" \
                      --eval "(package-install 'dash)"

    - name: Create no-tlmgr.el
      run: |
        mkdir -p ~/.emacs.d
        echo "(setq system-packages-use-sudo nil)" > ~/.emacs.d/no-tlmgr.el
        echo "(setq TeX-install-font-lock nil)" >> ~/.emacs.d/no-tlmgr.el
        echo "(setq TeX-live-install-texmf nil)" >> ~/.emacs.d/no-tlmgr.el

    - name: Verify ox-ipynb Installation
      run: |
        emacs --batch \
              --eval "(add-to-list 'load-path \"~/Software/scimax/\")" \
              --eval "(dolist (dir (directory-files \"~/.emacs.d/elpa/\" t \"^[^.]\")) (add-to-list 'load-path dir))" \
              --eval "(require 'ox-ipynb)"

    - name: Execute Makefile notebooksYslides
      run: |
        make notebooksYslides

    - name: Inspección contenido de Lecciones/img
      run: |
        echo "CONTENIDO DE IMG TRAS NOTEBOOK:"
        find ./Lecciones/img

    - name: Execute Makefile publicacion
      run: |
        make practicas publicacion calendario

    - name: Deploy docs/ a gh-pages
      uses: peaceiris/actions-gh-pages@v4
      with:
        github_token: ${{ secrets.GH_PAGES_TOKEN }}
        publish_dir: ./docs
        publish_branch: gh-pages
        destination_dir: docs
#+END_SRC

#    - name: Crear local-init.el para Emacs
#      run: |
#        mkdir -p ~/Software/scimax
#        echo "(setq straight-vc-git-default-clone-depth nil)" > ~/Software/scimax/local-init.el
#        echo "(condition-case err" >> ~/Software/scimax/local-init.el
#        echo "    (straight-use-package 'nongnu-elpa)" > ~/Software/scimax/local-init.el
#        echo "(error (message "straight.el failed: %s" err)))" > ~/Software/scimax/local-init.el


** Aclaraciones

**** tlmgr
Scimax intenta usar ~tlmgr~ para instalar paquetes de $\LaTeX{}$, pero =Actions= de =GitHub= no lo permite. Las medidas tomadas para evitar este problema han sido 
1. crear un fichero =~/.emacs.d/no-tlmgr.el= con el siguiente contenido
   #+BEGIN_SRC 
(setq system-packages-use-sudo nil)
(setq TeX-install-font-lock nil)
   #+END_SRC
   De manera que al publicar se llama a scimax del siguiente modo
   #+BEGIN_SRC 
emacs --batch \
  --load ~/.emacs.d/no-tlmgr.el \
  --load ~/Software/scimax/init.el \
  -l publica.el
   #+END_SRC
2. En ~.github/workflows/build.yml~ he añadido
   #+BEGIN_SRC 
    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true
   #+END_SRC

Quizá sea suficiente solo con esto segundo. Si quito el fichero =~/.emacs.d/no-tlmgr.el=, también he de omitirlo en las llamadas a emacs.

**** Figuras en =.png=

No lo tengo claro, pero creo que 
#+BEGIN_SRC 
    - name: Set MPLBACKEND (matplotlib)
      run: echo "MPLBACKEND=Agg" >> $GITHUB_ENV
#+END_SRC
se puede borrar, puesto que al final he tenido que añadir ~plt.savefig(nombre_fichero, dpi=300, bbox_inches='tight')~ explícitamente en los bloques de python. En el notebook creo que también se puede quitar los de ~Agg~. Lo de ~Agg~ es una sugerencia de Copilot porque no se generaban los ficheros ~.png~. Pero como ahora se indica explícitamente en el código pyton con ~plt.savefig~, es posible que se pueda omitir (véase la conversación con Copilot a continuación).


*** Consulta a Copilot sobre la generación de figuras

#+BEGIN_QUOTE
Anteriormente faltaba por instalar el paquete dvipng. Una vez instalado dvipng, el bloque de código:

#+BEGIN_SRC jupyter-python :results file :exports results
plt.plot([1,2,3],[4,5,6])
plt.savefig("img/prueba_action.png")
"img/prueba_action.png"
#+END_SRC

ha creado correctamente el fichero "img/prueba_action.png" con la figura. Sin embargo, el bloque

#+BEGIN_SRC jupyter-python :results file :file ./img/lecc01/PIB_UEM.png
df1.plot(x='obs',xlabel='',figsize=(15,4)).set_title('PIB zona euro',fontsize=18)
#+END_SRC

no ha creado el fichero ./img/lecc01/PIB_UEM.png con su correspondiente figura.
#+END_QUOTE


¡Excelente que la instalación de dvipng haya solucionado la generación de imágenes para el primer bloque!  
Ahora, pasemos a analizar por qué el segundo bloque *no genera* el archivo `./img/lecc01/PIB_UEM.png`.

-----

**** Diagnóstico y causas probables

***** 1. Diferencia clave entre ambos bloques

- *Bloque que funciona:*

  #+BEGIN_SRC org
  #+BEGIN_SRC jupyter-python :results file :exports results
  plt.plot([1,2,3],[4,5,6])
  plt.savefig("img/prueba_action.png")
  "img/prueba_action.png"
  #+END_SRC
  #+END_SRC

  - Aquí, tú generas la figura y la guardas explícitamente con `plt.savefig()`, y luego devuelves el nombre del archivo en la última línea.

- *Bloque que falla:*

  #+BEGIN_SRC org
  #+BEGIN_SRC jupyter-python :results file :file ./img/lecc01/PIB_UEM.png
  df1.plot(x='obs',xlabel='',figsize=(15,4)).set_title('PIB zona euro',fontsize=18)
  #+END_SRC
  #+END_SRC

  - Aquí confías en que org-babel/jupyter-python guardará automáticamente la figura en `:file`, pero el método pandas `df.plot()` *no guarda ni devuelve* el archivo.

