docs/org-publish.html
<div id="outline-container-org9b7967f" class="outline-2">
<h2 id="org9b7967f">Fichero <code>build.yml</code></h2>
<div class="outline-text-2" id="text-org9b7967f">
<p>
Contiene las instrucciones que ejecutará GitHub Actions en el repositorio.
</p>

<p>
Usa el contenido de la rama <code>main</code>. 
</p>
<div class="org-src-container">
<pre class="src src-yml"><code>name: Build and Deploy

on:
  push:
    branches:
      - main

jobs:
  build:
    runs-on: ubuntu-latest

    steps:
    - name: Checkout repository
      uses: actions/checkout@v3

    - name: Set up Python
      uses: actions/setup-python@v4
      with:
        python-version: '3.9'

    - name: Install dependencies
      run: |
        sudo apt-get update
        sudo apt-get install -y emacs pandoc aspell aspell-en aspell-es
        pip install jupyter nbconvert

    - name: Install Python modules
      run: |
        pip install sympy numpy pandas matplotlib dataframe-image statsmodels seaborn

    - name: Set MPLBACKEND (matplotlib)
      run: echo "MPLBACKEND=Agg" &gt;&gt; $GITHUB_ENV

    - name: Verify Jupyter Installation
      run: |
        jupyter kernelspec list

    - name: Install LaTeX
      run: |
        sudo apt-get install -y texlive  texlive-latex-recommended texlive-latex-extra  texlive-fonts-extra texlive-fonts-recommended texlive-xetex texlive-science python3-pygments texlive-lang-spanish texlive-bibtex-extra texlive-binaries texlive-extra-utils texlive-font-utils texlive-luatex texlive-xetex dvipng

    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true

    - name: Clone Scimax
      run: |
        git clone https://github.com/jkitchin/scimax.git ~/Software/scimax

    - name: Download ox-ipynb.el
      run: |
        wget https://raw.githubusercontent.com/jkitchin/ox-ipynb/master/ox-ipynb.el -O ~/Software/scimax/ox-ipynb.el

    - name: Install s.el and dash.el
      run: |
        emacs --batch --eval "(require 'package)" \
                      --eval "(add-to-list 'package-archives '(\"melpa\" . \"https://melpa.org/packages/\"))" \
                      --eval "(package-refresh-contents)" \
                      --eval "(package-install 's)" \
                      --eval "(package-install 'dash)"

    - name: Create no-tlmgr.el
      run: |
        mkdir -p ~/.emacs.d
        echo "(setq system-packages-use-sudo nil)" &gt; ~/.emacs.d/no-tlmgr.el
        echo "(setq TeX-install-font-lock nil)" &gt;&gt; ~/.emacs.d/no-tlmgr.el
        echo "(setq TeX-live-install-texmf nil)" &gt;&gt; ~/.emacs.d/no-tlmgr.el

    - name: Verify ox-ipynb Installation
      run: |
        emacs --batch \
              --load ~/.emacs.d/no-tlmgr.el \
              --eval "(add-to-list 'load-path \"~/Software/scimax/\")" \
              --eval "(dolist (dir (directory-files \"~/.emacs.d/elpa/\" t \"^[^.]\")) (add-to-list 'load-path dir))" \
              --eval "(require 'ox-ipynb)"

    - name: Execute Makefile notebooksYslides
      run: |
        make notebooksYslides

    - name: Inspección contenido de img
      run: |
        echo "CONTENIDO DE IMG TRAS NOTEBOOK:"
        find ./lecciones/img

#    - name: Copia del directorio de imagenes a docs
#      run: |
#        cp -a ./lecciones/img ./docs

    - name: Execute Makefile publicacion
      run: |
        make publicacion calendario

    - name: Deploy docs/ a gh-pages
      uses: peaceiris/actions-gh-pages@v4
      with:
        github_token: ${{ secrets.GH_PAGES_TOKEN }}
        publish_dir: ./docs
        publish_branch: gh-pages
        destination_dir: docs
</code></pre>
</div>
</div>
<div id="outline-container-org91cbecb" class="outline-3">
<h3 id="org91cbecb">Aclaraciones</h3>
<div class="outline-text-3" id="text-org91cbecb">
</div>
<ul class="org-ul">
<li><a id="org887648b"></a>tlmgr<br />
<div class="outline-text-5" id="text-org887648b">
<p>
Scimax intenta usar <code>tlmgr</code> para instalar paquetes de \(\LaTeX{}\), pero <code>Actions</code> de <code>GitHub</code> no lo permite. Las medidas tomadas para evitar este problema han sido 
</p>
<ol class="org-ol">
<li><p>
crear un fichero <code>~/.emacs.d/no-tlmgr.el</code> con el siguiente contenido
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>(setq system-packages-use-sudo nil)
(setq TeX-install-font-lock nil)
</code></pre>
</div>
<p>
De manera que al publicar se llama a scimax del siguiente modo
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>emacs --batch \
  --load ~/.emacs.d/no-tlmgr.el \
  --load ~/Software/scimax/init.el \
  -l publica.el
</code></pre>
</div></li>
<li><p>
En <code>.github/workflows/build.yml</code> he añadido
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true
</code></pre>
</div></li>
</ol>

<p>
Quizá sea suficiente solo con esto segundo. Si quito el fichero <code>~/.emacs.d/no-tlmgr.el</code>, también he de omitirlo en las llamadas a emacs.
</p>
</div>
</li>
<li><a id="org01c43e5"></a>Figuras en <code>.png</code><br />
<div class="outline-text-5" id="text-org01c43e5">
<p>
No lo tengo claro, pero creo que 
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>    - name: Set MPLBACKEND (matplotlib)
      run: echo "MPLBACKEND=Agg" &gt;&gt; $GITHUB_ENV
</code></pre>
</div>
<p>
se puede borrar, puesto que al final he tenido que añadir <code>plt.savefig(nombre_fichero, dpi=300, bbox_inches='tight')</code> explícitamente en los bloques de python. En el notebook creo que también se puede quitar los de <code>Agg</code>. Lo de <code>Agg</code> es una sugerencia de Copilot porque no se generaban los ficheros <code>.png</code>. Pero como ahora se indica explícitamente en el código pyton con <code>plt.savefig</code>, es posible que se pueda omitir (véase la conversación con Copilot a continuación).
</p>
</div>
</li>
</ul>
<div id="outline-container-orgdf187f0" class="outline-4">
<h4 id="orgdf187f0">Consulta a Copilot sobre la generación de figuras</h4>
<div class="outline-text-4" id="text-orgdf187f0">
<blockquote>
<p>
Anteriormente faltaba por instalar el paquete dvipng. Una vez instalado dvipng, el bloque de código:
</p>

<p>
ha creado correctamente el fichero "img/prueba_action.png" con la figura. Sin embargo, el bloque
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code>df1.plot(x=<span style="font-style: italic;">'obs'</span>,xlabel=<span style="font-style: italic;">''</span>,figsize=(15,4)).set_title(<span style="font-style: italic;">'PIB zona euro'</span>,fontsize=18)
</code></pre>
</div>

<p>
no ha creado el fichero ./img/lecc01/PIB_UEM.png con su correspondiente figura.
</p>
</blockquote>


<p>
¡Excelente que la instalación de dvipng haya solucionado la generación de imágenes para el primer bloque!  
Ahora, pasemos a analizar por qué el segundo bloque <b>no genera</b> el archivo `./img/lecc01/PIB_UEM.png`.
</p>

<hr />
</div>
<ul class="org-ul">
<li><a id="orgd11fe2d"></a>Diagnóstico y causas probables<br />
<ul class="org-ul">
<li><a id="orgdae6a64"></a>1. Diferencia clave entre ambos bloques<br />
<div class="outline-text-6" id="text-orgdae6a64">
<ul class="org-ul">
<li><p>
<b>Bloque que funciona:</b>
</p>

<div class="org-src-container">
<pre class="src src-org"><code>  #+BEGIN<span style="color: #0000ff; text-decoration: underline;">_SRC</span> jupyter-python :results file :exports results
  plt.plot([1,2,3],[4,5,6])
  plt.savefig("img/prueba<span style="color: #0000ff; text-decoration: underline;">_action.png</span>")
  "img/prueba<span style="color: #0000ff; text-decoration: underline;">_action.png</span>"
</code></pre>
</div>
<p>
#+END_SRC
</p>

<ul class="org-ul">
<li>Aquí, tú generas la figura y la guardas explícitamente con `plt.savefig()`, y luego devuelves el nombre del archivo en la última línea.</li>
</ul></li>

<li><p>
<b>Bloque que falla:</b>
</p>

<div class="org-src-container">
<pre class="src src-org"><code>  #+BEGIN<span style="color: #0000ff; text-decoration: underline;">_SRC</span> jupyter-python :results file :file ./img/lecc01/PIB<span style="color: #0000ff; text-decoration: underline;">_UEM.png</span>
  df1.plot(x='obs',xlabel='',figsize=(15,4)).set<span style="color: #0000ff; text-decoration: underline;">_title</span>('PIB zona euro',fontsize=18)
</code></pre>
</div>
<p>
#+END_SRC
</p>

<ul class="org-ul">
<li>Aquí confías en que org-babel/jupyter-python guardará automáticamente la figura en `:file`, pero el método pandas `df.plot()` <b>no guarda ni devuelve</b> el archivo.</li>
</ul></li>
</ul>
</div>
</li>
