docs/org-publish.html
<li><a id="org8e37c30"></a>2. ¿Por qué falla el segundo bloque?<br />
<div class="outline-text-6" id="text-org8e37c30">
<ul class="org-ul">
<li>El argumento `:file ./img/lecc01/PIB_UEM.png` espera que el último comando del bloque <b>guarde la imagen en ese path</b> (o devuelva una figura que org/jupyter pueda guardar ahí).</li>
<li>El método `df1.plot(&hellip;).set_title(&hellip;)` crea y modifica una figura activa, pero <b>no la guarda</b>.</li>
<li>Si usas solo `set_title()`, no hay ninguna instrucción para guardar el gráfico.</li>
<li>Por defecto, ni org-babel ni jupyter-python pueden adivinar que la figura debe ser guardada en ese path si no se lo indicas de forma explícita.</li>
</ul>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org9c9ef23"></a>Solución recomendada<br />
<div class="outline-text-5" id="text-org9c9ef23">
<p>
<b>Debes guardar la figura manualmente al path especificado</b>, y devolver ese path como resultado del bloque.
</p>
</div>
<ul class="org-ul">
<li><a id="orga532a23"></a>Forma correcta:<br />
<div class="outline-text-6" id="text-orga532a23">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">ax</span> = df1.plot(x=<span style="font-style: italic;">'obs'</span>, xlabel=<span style="font-style: italic;">''</span>, figsize=(15,4))
ax.set_title(<span style="font-style: italic;">'PIB zona euro'</span>, fontsize=18)
<span style="font-weight: bold;">import</span> matplotlib.pyplot <span style="font-weight: bold;">as</span> plt
plt.savefig(<span style="font-style: italic;">"./img/lecc01/PIB_UEM.png"</span>)
<span style="font-style: italic;">"./img/lecc01/PIB_UEM.png"</span>
</code></pre>
</div>

<ul class="org-ul">
<li>Esto asegura que la imagen se guarda donde deseas y que el bloque devuelve el path correcto para que org-babel inserte la imagen en el documento.</li>
</ul>
</div>
</li>
<li><a id="org3cc0665"></a>Alternativas<br />
<div class="outline-text-6" id="text-org3cc0665">
<ul class="org-ul">
<li>Si usas solo `:results file` sin `:file`, puedes devolver el nombre del archivo en la última línea.</li>
<li>Siempre asegúrate de llamar a `plt.savefig()` <b>después</b> de crear el gráfico.</li>
</ul>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org9009938"></a>Resumen<br />
<div class="outline-text-5" id="text-org9009938">
<ul class="org-ul">
<li>El bloque con `plt.savefig(&hellip;)` funciona porque guarda explícitamente la imagen.</li>
<li>El bloque con pandas `plot` y solo `set_title()` <b>NO guarda la imagen</b>; debes añadir `plt.savefig()` y devolver el path.</li>
<li>Así, org-babel/jupyter-python incrustará correctamente la imagen en el documento exportado.</li>
</ul>

<hr />

<p>
¿Te gustaría que te ayude a actualizar todos los bloques de tu .org para que usen esta técnica, o necesitas una guía para automatizar este patrón?
</p>

<blockquote>
<p>
Sin embargo. Cuando ejecuto localmente el fichero org sí se crean las figuras en mi disco. ¿Hay algún modo de que también se creen con Actions sin modificar los bloques? Es decir, ¿hay algún modo de que funcionen tal y como están ahora mismo?
</p>
</blockquote>

<p>
¡Esta es una pregunta muy frecuente al usar org-babel/jupyter en entornos CI/CD!  
La diferencia entre tu entorno local y GitHub Actions suele deberse a <b>la configuración del entorno gráfico</b> y de <b>matplotlib</b>.
</p>

<hr />
</div>
</li>
<li><a id="orgc091821"></a>¿Por qué funciona localmente pero no en Actions?<br />
<div class="outline-text-5" id="text-orgc091821">
<ul class="org-ul">
<li><b>Localmente</b>, matplotlib tiene acceso a un entorno gráfico (X11, Wayland, etc.) y suele usar un backend como `TkAgg`, `Qt5Agg`,…</li>
<li><b>En GitHub Actions</b> (o cualquier entorno headless), <b>matplotlib no tiene acceso a un display</b> y por defecto puede intentar usar un backend que requiere uno, lo que impide guardar imágenes.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org077f05a"></a>Backend headless necesario<br />
<div class="outline-text-6" id="text-org077f05a">
<p>
Para guardar imágenes sin display, <b>matplotlib debe usar un backend como "Agg"</b>.
</p>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="orgbe65d8b"></a>Solución: Forzar el backend "Agg" para matplotlib<br />
<div class="outline-text-5" id="text-orgbe65d8b">
<p>
Esto se puede hacer <b>sin modificar los bloques</b> añadiendo una configuración previa en tu flujo de trabajo o al comienzo de la ejecución.
</p>
</div>
<ul class="org-ul">
<li><a id="org84ba589"></a>Opción 1: Variable de entorno en el workflow<br />
<div class="outline-text-6" id="text-org84ba589">
<p>
Añade esto antes de ejecutar Emacs en tu `build.yml`:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><code>- name: Set MPLBACKEND (matplotlib)
  run: echo "MPLBACKEND=Agg" &gt;&gt; $GITHUB_ENV
</code></pre>
</div>

<p>
Matplotlib detectará esto y usará el backend adecuado.
</p>
</div>
</li>
<li><a id="org304c05e"></a>Opción 2: Variable de entorno en shell<br />
<div class="outline-text-6" id="text-org304c05e">
<p>
O directamente en el comando de ejecución:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code><span style="font-weight: bold; font-style: italic;">MPLBACKEND</span>=Agg emacs -Q -l ~/Software/scimax/init.el ./lecciones/Lecc01.org --batch ...
</code></pre>
</div>
</div>
</li>
<li><a id="orgfe00e79"></a>Opción 3: Configuración en Emacs/jupyter-python<br />
<div class="outline-text-6" id="text-orgfe00e79">
<p>
Si puedes modificar la configuración de Emacs que se carga, añade a tu init.el o a la cabecera de los bloques:
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="font-weight: bold;">import</span> matplotlib
matplotlib.use(<span style="font-style: italic;">"Agg"</span>)
</code></pre>
</div>

<p>
Pero esto requeriría modificar los bloques, que quieres evitar.
</p>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org0131942"></a>Resumen<br />
<div class="outline-text-5" id="text-org0131942">
<ul class="org-ul">
<li><b>El problema</b>: matplotlib necesita el backend "Agg" para funcionar headless.</li>
<li><b>La solución sin modificar los bloques</b>: establece la variable de entorno `MPLBACKEND=Agg` en el workflow antes de ejecutar Emacs.</li>
<li><b>Así</b>, los bloques que generan imágenes funcionarán igual en Actions que localmente, <b>sin necesidad de cambiar el código de los bloques</b>.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
