docs/org-publish.html
<div id="outline-container-org4c1ff12" class="outline-2">
<h2 id="org4c1ff12">Script <code>publica.el</code> de elisp para publicar los <code>.org</code> es formato <code>pdf</code> y <code>html</code></h2>
<div class="outline-text-2" id="text-org4c1ff12">
<p>
Este script transforma los ficheros org de las lecciones en pdfs y htmls. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">publica.el --- Publicaci&#243;n HTML y PDF para el repositorio Scimax-ELN
</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF tras ejecutar bloques de c&#243;digo."</span>
  (message <span style="font-style: italic;">"Exportando a PDF: %s"</span> filename)
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(org-babel-execute-buffer)
</span>    (org-latex-publish-to-pdf plist filename pub-dir)))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./lecciones/"</span>)
       (public-directory <span style="font-style: italic;">"./docs/"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        `((<span style="font-style: italic;">"images"</span>
           <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./lecciones/img/"</span>
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,(concat public-directory <span style="font-style: italic;">"img"</span>)
           <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

          (<span style="font-style: italic;">"html"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="font-weight: bold;">:auto-preamble</span> t)

          (<span style="font-style: italic;">"pdf"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,(concat public-directory <span style="font-style: italic;">"pdfs"</span>)
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf
           <span style="font-weight: bold;">:auto-preamble</span> t)

          (<span style="font-style: italic;">"static-html"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">csv</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gdt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

          (<span style="font-style: italic;">"scimax-eln"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"static-html"</span> <span style="font-style: italic;">"pdf"</span> <span style="font-style: italic;">"images"</span>))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n de lecciones (scimax-eln)..."</span>)
  (org-publish <span style="font-style: italic;">"scimax-eln"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n de lecciones completada."</span>))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        (append org-publish-project-alist
                `((<span style="font-style: italic;">"index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">chatCopilot.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.org"</span>
                   <span style="font-weight: bold;">:recursive</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> t
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"static-index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"lecciones</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">chatCopilot.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.*"</span>
                   <span style="font-weight: bold;">:recursive</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                  (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"static-index"</span>)))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n del &#237;ndice (web-repositorio)..."</span>)
  (org-publish <span style="font-style: italic;">"web-repositorio"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n del &#237;ndice completada."</span>))

(<span style="font-weight: bold;">unless</span> (file-directory-p <span style="font-style: italic;">"logs"</span>)
  (make-directory <span style="font-style: italic;">"logs"</span>))
(<span style="font-weight: bold;">with-temp-file</span> <span style="font-style: italic;">"logs/publica.log"</span>
  (insert (format <span style="font-style: italic;">"Publicado el %s\n"</span> (current-time-string))))

</code></pre>
</div>

<p>
Podemos chequear la versión local ejecutando el siguiente bloque
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(browse-url <span style="font-style: italic;">"docs/index.html"</span>)
</code></pre>
</div>
</div>
</div>
